using System.Collections.Generic;

namespace Waher.Content.CharacterSets
{
	/// <summary>
	/// WINDOWS-1257 encoding.
	/// </summary>
	public class Windows1257 : WindowsCodePage
	{
		private readonly static Dictionary<char, byte> bytes = ReverseDictionary(chars);
		private readonly static char?[] chars = new char?[256]
		{
			'\x00','\x01','\x02','\x03','\x04','\x05','\x06','\x07',	// 00
			'\x08','\x09','\x0a','\x0b','\x0c','\x0d','\x0e','\x0f',
			'\x10','\x11','\x12','\x13','\x14','\x15','\x16','\x17',	// 10
			'\x18','\x19','\x1a','\x1b','\x1c','\x1d','\x1e','\x1f',
			' ', '!', '"', '#', '$', '%', '&', '\'',					// 20
			'(', ')', '*', '+', ',', '-', '.', '/',
			'0', '1', '2', '3', '4', '5', '6', '7',						// 30
			'8', '9', ':', ';', '<', '=', '>', '?',
			'@', 'A', 'B', 'C', 'D', 'E', 'F', 'G',						// 40
			'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O',
			'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W',						// 50
			'X', 'Y', 'Z', '[', '\\', ']', '^', '_',
			'`', 'a', 'b', 'c', 'd', 'e', 'f', 'g',						// 60
			'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
			'p', 'q', 'r', 's', 't', 'u', 'v', 'w',						// 70
			'x', 'y', 'z', '{', '|', '}', '~', '\x7f',
			'€', _NA, '‚', _NA, '„', '…', '†', '‡',						// 80
			_NA, '‰', _NA, '‹' ,_NA, '¨', 'ˇ', '¸',
			_NA, '‘', '’', '“', '”', '•', '–', '—',						// 90
			_NA, '™', _NA, '›', _NA, '¯', '˛', _NA,
			'\xa0', _NA, '¢', '£', '¤', _NA, '¦', '§',					// A0
			'Ø', '©', 'Ŗ', '«', '¬', '\xad', '®', 'Æ',
			'°', '±', '²', '³', '´', 'µ', '¶', '·',						// B0
			'ø', '¹', 'ŗ', '»', '¼', '½', '¾', 'æ',
			'Ą', 'Į', 'Ā', 'Ć', 'Ä', 'Å', 'Ę', 'Ē',						// C0
			'Č', 'É', 'Ź', 'Ė', 'Ģ', 'Ķ', 'Ī', 'Ļ',
			'Š', 'Ń', 'Ņ', 'Ó', 'Ō', 'Õ', 'Ö', '×',						// D0
			'Ų', 'Ł', 'Ś', 'Ū', 'Ü', 'Ż', 'Ž', 'ß',
			'ą', 'į', 'ā', 'ć', 'ä', 'å', 'ę', 'ē',						// E0
			'č', 'é', 'ź', 'ė', 'ģ', 'ķ', 'ī', 'ļ',
			'š', 'ń', 'ņ', 'ó', 'ō', 'õ', 'ö', '÷',						// F0
			'ų', 'ł', 'ś', 'ū', 'ü', 'ż', 'ž', '˙'
		};

		/// <summary>
		/// WINDOWS-1257 encoding.
		/// </summary>
		public Windows1257()
			: base(chars, bytes)
		{
		}
	}
}
