using System.Collections.Generic;

namespace Waher.Content.CharacterSets
{
	/// <summary>
	/// WINDOWS-1252 encoding.
	/// </summary>
	public class Windows1252 : WindowsCodePage
	{
		private readonly static Dictionary<char, byte> bytes = ReverseDictionary(chars);
		private readonly static char?[] chars = new char?[256]
		{
			'\x00','\x01','\x02','\x03','\x04','\x05','\x06','\x07',	// 00
			'\x08','\x09','\x0a','\x0b','\x0c','\x0d','\x0e','\x0f',
			'\x10','\x11','\x12','\x13','\x14','\x15','\x16','\x17',	// 10
			'\x18','\x19','\x1a','\x1b','\x1c','\x1d','\x1e','\x1f',
			' ', '!', '"', '#', '$', '%', '&', '\'',					// 20
			'(', ')', '*', '+', ',', '-', '.', '/',
			'0', '1', '2', '3', '4', '5', '6', '7',						// 30
			'8', '9', ':', ';', '<', '=', '>', '?',
			'@', 'A', 'B', 'C', 'D', 'E', 'F', 'G',						// 40
			'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O',
			'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W',						// 50
			'X', 'Y', 'Z', '[', '\\', ']', '^', '_',
			'`', 'a', 'b', 'c', 'd', 'e', 'f', 'g',						// 60
			'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
			'p', 'q', 'r', 's', 't', 'u', 'v', 'w',						// 70
			'x', 'y', 'z', '{', '|', '}', '~', '\x7f',
			'€', _NA, '‚', 'ƒ', '„', '…', '†', '‡',						// 80
			'ˆ', '‰', 'Š', '‹', 'Œ', _NA, 'Ž', _NA,
			_NA, '‘', '’', '“', '”', '•', '–', '—',						// 90
			'˜', '™', 'š', '›', 'œ', _NA, 'ž', 'Ÿ',
			'\xa0', '¡', '¢', '£', '¤', '¥', '¦', '§',					// A0
			'¨', '©', 'ª', '«', '¬', '\xad', '®', '¯',
			'°', '±', '²', '³', '´', 'µ', '¶', '·',						// B0
			'¸', '¹', 'º', '»', '¼', '½', '¾', '¿',
			'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',						// C0
			'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',
			'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',						// D0
			'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',
			'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',						// E0
			'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',
			'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',						// F0
			'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',
		};

		/// <summary>
		/// WINDOWS-1252 encoding.
		/// </summary>
		public Windows1252()
			: base(chars, bytes)
		{
		}
	}
}
